app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
    def index
      @school_classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Gym"], ["room_number", 0], ["created_at", "2016-06-12 16:43:42.881364"], ["updated_at", "2016-06-12 16:43:42.881364"]]
---
    def create
      @school_class = SchoolClass.new(school_class_params(:title, :room_number))
      @school_class.save