app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT  "students".* FROM "students"  ORDER BY "students"."id" ASC LIMIT 1

  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student))
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Bogran \"the knife\""], ["updated_at", "2017-09-09 22:05:00.267384"], ["id", 13]]